Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 41, 10, 10)        0         
_________________________________________________________________
reshape_1 (Reshape)          (None, 41, 10, 10)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 41, 10, 512)       46080     
_________________________________________________________________
batch_normalization_1 (Batch (None, 41, 10, 512)       2048      
_________________________________________________________________
activation_1 (Activation)    (None, 41, 10, 512)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 41, 10, 512)       2359296   
_________________________________________________________________
batch_normalization_2 (Batch (None, 41, 10, 512)       2048      
_________________________________________________________________
activation_2 (Activation)    (None, 41, 10, 512)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 39, 8, 512)        2359296   
_________________________________________________________________
batch_normalization_3 (Batch (None, 39, 8, 512)        2048      
_________________________________________________________________
activation_3 (Activation)    (None, 39, 8, 512)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 37, 6, 512)        2359296   
_________________________________________________________________
batch_normalization_4 (Batch (None, 37, 6, 512)        2048      
_________________________________________________________________
activation_4 (Activation)    (None, 37, 6, 512)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 113664)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              116391936 
_________________________________________________________________
batch_normalization_5 (Batch (None, 1024)              4096      
_________________________________________________________________
activation_5 (Activation)    (None, 1024)              0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 1024)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 512)               524288    
_________________________________________________________________
batch_normalization_6 (Batch (None, 512)               2048      
_________________________________________________________________
activation_6 (Activation)    (None, 512)               0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 512)               0         
_________________________________________________________________
pi (Dense)                   (None, 100)               51300     
=================================================================
Total params: 124,105,828
Trainable params: 124,098,660
Non-trainable params: 7,168
_________________________________________________________________
